emacs/.emacs.d/init.org
#+TITLE: Tsudo's Emacs Config
#+DATE: 6/19/2023
#+AUTHOR: The Programming M16A4
#+STARTUP: showall
#+PROPERTY: header-args:emacs-lisp :tangle yes :tangle init.el

*  _______            _       _       ______                             _____             __ _       
* |__   __|          | |     ( )     |  ____|                           / ____|           / _(_)      
*    | |___ _   _  __| | ___ |/ ___  | |__   _ __ ___   __ _  ___ ___  | |     ___  _ __ | |_ _  __ _ 
*    | / __| | | |/ _` |/ _ \  / __| |  __| | '_ ` _ \ / _` |/ __/ __| | |    / _ \| '_ \|  _| |/ _` |
*    | \__ \ |_| | (_| | (_) | \__ \ | |____| | | | | | (_| | (__\__ \ | |___| (_) | | | | | | | (_| |
*    |_|___/\__,_|\__,_|\___/  |___/ |______|_| |_| |_|\__,_|\___|___/  \_____\___/|_| |_|_| |_|\__, |
*                                                                                                __/ |
*                                                                                               |___/ 

* About
Website: <insert here if I ever make one>
GitHub: https://github.com/The-Tech-Lord/dotfiles

I started programming with Sublime Text 3 back in 9th grade and some time passes and I start using VS Code. More time passes and I start to use Vim as my main editor. I've been
aware of GNU Emacs existence (due to my coding summer camp instructor who's used it for a while I presume) for a while and tried it out a couple times though it just didn't really
stick with me, mostly due to the fact I thought it was a bit too complicated to use effectively. In mid June 2023 (you can check the commit history), I decided to give Emacs
another try as I wanted to try something new since I've been using Vim for quite a while now.

I went with GNU Emacs because it was lightweight and wasn't resource intensive; not knowing much about its other features. Using an editor like VS Code while having a bunch of tabs
open would start to ramp up my laptop's fans. This goes back to when I was using a DELL Inspiron 15 7000 2-in-1 (Intel Core i5, Intel UHD Graphics, 8GB RAM, one cooling fan).

You'll soon see from my config below that I'm also an organization junkie.

** Packages I've Installed
*** Modes
- csharp-mode: Major mode for C#
- vimrc-mode: Major mode for vimrc configuration files
  
*** Themes
- gruvbox-theme: If you aren't using Gruvbox, what are you doing with your life?

* Setup
** Programming Environment
*** Python
**** Windows
Software: Python, pip, Pyright

1. Install Pyright through pip

*** Java
**** Windows
Software: Eclipse JDT (https://github.com/eclipse-jdtls/eclipse.jdt.ls), Java SDK

1. Clone Eclipse JDT LS repository through release tags
2. Add Java SDK to PATH environment variable
3. Build repository with `/.mvnw clean verify -DskipTests=true`
4. Add `../org.eclipse.jdt.ls.product/target/repository` to PATH variable

*** C
**** Windows
Software: gcc

1.

*** C++
**** Windows
Software: Visual Studio Build Tools, LLVM, clang, gcc

1. Install LLVM installer and have it setup the user PATH variable
2. Install Visual Studio Builds Tools 20XX with the "Desktop development with C++" module

*** Lua
**** Windows
Software: Lua interpreter

1.

*** Haskell
**** Windows
Software: GHCup, Haskell LSP

1. Install Haskell LSP and compiler with GHCup
   
*** Perl
**** Windows
Software:

1.

*** VHDL
**** Windows
Software:

1.

*** Verilog
**** Windows
Software:

1.

*** HTML
**** Windows
Software:

1.

*** CSS
**** Windows
Software:

1.

** Spell Checking
*** Windows
Software: MSYS2, aspell

1. Install `aspell` through MSYS2

* Packages
** Package Repositories
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)
#+END_SRC

** Auto Installation
Theme(s):
  - Gruvbox: gruvbox-theme
  
Major Modes:
  - C#: csharp-mode
  - Vimrc: vimrc-mode

Language Server Protocol:
  - Python: jedi-language-server (https://github.com/pappasam/jedi-language-server)
  - Java  : Eclipse JDT Language Server (https://github.com/eclipse-jdtls/eclipse.jdt.ls)
  - C/C++ : clangd (https://clangd.llvm.org/installation)
  - C#    : omnisharp (https://github.com/OmniSharp/omnisharp-roslyn)


#+BEGIN_SRC emacs-lisp
(setq package-selected-packages
 '(csharp-mode vimrc-mode gruvbox-theme jedi-language-server))
#+END_SRC

* Settings
Technically, any customization that happens in this file is a "setting." To give clarity of what any customizations that are under Settings, they can be thought of as more
"surface-level" customizations.

** Emacs
*** Startup
#+BEGIN_SRC emacs-lisp
(setq inhibit-splash-screen t)                     ;; Startup Screen
#+END_SRC

*** Display
**** UI
#+BEGIN_SRC emacs-lisp
(scroll-bar-mode -1)
(menu-bar-mode -1)
(tool-bar-mode -1)
#+END_SRC

***** Lines
- TODO: Variable `display-line-numbers-width` between file line sizes

#+BEGIN_SRC emacs-lisp
(setq-default column-number-mode t)
(global-display-line-numbers-mode)
#+END_SRC

**** Tabs (Tab Character)
- `tab-width`: Used to adjust the distance between tab stops.
- `indent-tabs-mode`: Toggles whether indentation can insert TAB characters.
- `backward-delete-char-untabify-method`: Holds the method used to delete whitespace.

#+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
(setq-default indent-tabs-mode t)
(setq-default backward-delete-char-untabify-method nil)
#+END_SRC

*** Other
#+BEGIN_SRC emacs-lisp
(setq-default make-backup-files nil)
(setq-default fill-column 180)
#+END_SRC

** Custom
*** Variables
#+BEGIN_SRC emacs-lisp
(custom-set-variables
 '(custom-safe-themes
   '("b1a691bb67bd8bd85b76998caf2386c9a7b2ac98a116534071364ed6489b695d" "fa49766f2acb82e0097e7512ae4a1d6f4af4d6f4655a48170d0a00bcb7183970" "3e374bb5eb46eb59dbd92578cae54b16de138bc2e8a31a2451bf6fdb0f3fd81b" "19a2c0b92a6aa1580f1be2deb7b8a8e3a4857b6c6ccf522d00547878837267e7" "2ff9ac386eac4dffd77a33e93b0c8236bb376c5a5df62e36d4bfa821d56e4e20" "72ed8b6bffe0bfa8d097810649fd57d2b598deef47c992920aef8b5d9599eefe" "d80952c58cf1b06d936b1392c38230b74ae1a2a6729594770762dc0779ac66b7" default))
 )
#+END_SRC

*** Themes
#+BEGIN_SRC emacs-lisp
(load-theme 'gruvbox-dark-medium t)

;;(setq haki-region "#2e8b6d")
;;(load-theme 'haki t)
#+END_SRC

*** Startup
**** Launch Screen
I named this function after the kids show Wow Wow Wubzy simply because it sounded fun to use. This function will handle the customization of the launch screen.

#+BEGIN_SRC emacs-lisp
(defun wow-wow-wubzy()
  )
#+END_SRC

** Modal
*** Major Mode
**** Dired
#+BEGIN_SRC emacs-lisp
(setq-default ls-lisp-dirs-first t)
#+END_SRC

**** Org Mode
***** ToDo
****** Keywords
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
		'((sequence "TODO(t)" "IN-PROGRESS(i!)" "NEAR-COMP(n!)" "|" "DONE(d!)" "INCOMPLETE(c!)" "OVERDUE(o!)" "NEVER-DID(e)")
		  (sequence "BUG(b)" "MINOR" "MAJOR" "|" "FIXED(f@!)" "HOTFIX(h@!)")
		  (sequence "Heh")))
#+END_SRC

****** Faces
#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
	  '(("TODO" . org-warning) ("IN-PROGRESS" . "yellow") ("NEAR-COMP" . "orange") ("DONE" . "green")
		("BUG" . org-warning) ("FIXED" . "green")))
#+END_SRC

***** SRC Block
****** Indentation
#+BEGIN_SRC emacs-lisp
(setq org-src-preserve-indentation t)
(setq org-edit-src-content-indentation '0)
#+END_SRC

***** Agenda
****** Agenda View
#+BEGIN_SRC emacs-lisp
(setq org-agenda-span 'month)
#+END_SRC

****** Priorities
#+BEGIN_SRC emacs-lisp
(setq org-priority-highest '?A)
(setq org-priority-lowest '?E)
(setq org-priority-default '?C)
#+END_SRC

**** Development
#+BEGIN_SRC emacs-lisp
(defun prog_init()
  (flyspell-prog-mode)
  (company-mode)
  )
#+END_SRC

***** CC Mode
#+BEGIN_SRC emacs-lisp
(setq c-default-style "linux")    ;; Makes curly braces format how they're supposed to
#+END_SRC

****** C
#+BEGIN_SRC emacs-lisp
(defun c-mode-settings()
  (setq c-basic-offset 4)
  )
#+END_SRC

****** C++
#+BEGIN_SRC emacs-lisp
;; (defun cpp-mode-settings()
;;   )
#+END_SRC

****** Obj-C
#+BEGIN_SRC emacs-lisp
;; (defun objc-mode-settings()
;;   )
#+END_SRC

****** Java
#+BEGIN_SRC emacs-lisp
(defun java-mode-settings()
  (setq c-basic-offset 4)
  )
#+END_SRC

****** Idl
#+BEGIN_SRC emacs-lisp
;; (defun idl-mode-settings()
;;   )
#+END_SRC

****** Pike
#+BEGIN_SRC emacs-lisp
;; (defun pike-mode-settings()
;;   )
#+END_SRC

****** Awk
#+BEGIN_SRC emacs-lisp
;; (defun awk-mode-settings()
;;   )
#+END_SRC

***** Monty Python
#+BEGIN_SRC emacs-lisp
;; (defun python-mode-settings()
;;   )
#+END_SRC

***** Microsoft Java
#+BEGIN_SRC emacs-lisp
;; (defun cs-mode-settings()
;;   )
#+END_SRC

***** Hexl Mode
#+BEGIN_SRC emacs-lisp
;; (defun hexl-mode-settings()
;;   )
#+END_SRC

***** Version Control
The plan here is that when a git window is opened, it won't display the line numbers.
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** FlySpell
#+BEGIN_SRC emacs-lisp
(setq-default ispell-program-name "C:/msys64/mingw64/bin/aspell.exe")
#+END_SRC

*** Minor Mode
**** Whitespace Mode
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** ELDOC-BOX
#+BEGIN_SRC emacs-lisp

#+END_SRC

* Bindings
This is where you'll start to see my "wild" side. People have ventured here, only few returning with stories of a wacky, wild adventure. The horrors that one would see could not be
described with mere words. Others have sought out to witness for themselves the tortures the other adventurers have faced. Soon, it'll be known that it was their greatest mistake.

** Decodes
These parasites were taking up valuable land and resources so I needed to snip their umbilical cord.

Credit:
https://emacs.stackexchange.com/questions/10271/how-to-bind-c-for-real-seriously-for-real-this-time
https://emacs.stackexchange.com/questions/220/how-to-bind-c-i-as-different-from-tab
#+BEGIN_SRC emacs-lisp
;;(define-key input-decode-map [?\C-i] [C-i])    ;; TAB
;;(define-key input-decode-map [?\C-m] [C-m])    ;; RET
;;(define-key input-decode-map [?\C-\[] [C-\[])    ;; ESC
#+END_SRC

** Global
*** Essentials
**** Movement
***** Unbinding
****** Basic
These movement bindings are so cursed, why would anyone decide to use them for practical use?!?

#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-f"))    ;; forward-char
(global-unset-key (kbd "C-b"))    ;; backward-char
(global-unset-key (kbd "C-n"))    ;; next-line
(global-unset-key (kbd "C-p"))    ;; previous-line
#+END_SRC

****** Chunks
Named this little category "Chunks" because I can now refer to commands that effect more than one character without having to provide dedicated lvl 6 headers everywhere.

******* Words
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-f"))    ;; forward-word
(global-unset-key (kbd "M-b"))    ;; backward-word
(global-unset-key (kbd "ESC <left>"))    ;; backward-word
#+END_SRC

******* Sentences
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-a"))    ;; backward-sentence
(global-unset-key (kbd "M-e"))    ;; forward-sentence
#+END_SRC

******* Moisty
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-M-f"))    ;; forward-sexp
;; (global-unset-key (kbd "C-M-<right>"))    ;; forward-sexp
;; (global-unset-key (kbd "ESC C-<left>"))    ;; backward-sexp
;; (global-unset-key (kbd "ESC C-<right>"))    ;; forward-sexp
;; (global-unset-key (kbd "C-M-b"))    ;; backward-sexp
;; (global-unset-key (kbd "C-M-<left>"))    ;; backward-sexp
#+END_SRC

******* Pages
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x ["))    ;; backward-page
;; (global-unset-key (kbd "C-x ]"))    ;; forward-page
#+END_SRC

******* Defun
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-M-a"))    ;; beginning-of-defun
;; (global-unset-key (kbd "C-M-<home>"))    ;; beginning-of-defun
;; (global-unset-key (kbd "ESC C-<home>"))    ;; beginning-of-defun
;; (global-unset-key (kbd "C-M-e"))    ;; end-of-defun
;; (global-unset-key (kbd "C-M-<end>"))    ;; end-of-defun
;; (global-unset-key (kbd "ESC C-<end>"))    ;; end-of-defun
#+END_SRC

****** Whitespace
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-m"))    ;; back-to-indentation
(global-unset-key (kbd "M-i"))    ;; tab-to-tab-stop
#+END_SRC

****** Scrolling
