emacs/.emacs.d/init.el
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)

(setq package-selected-packages
 '(gruvbox-theme vimrc-mode))

(setq inhibit-splash-screen t)                     ;; Startup Screen
(load-theme 'gruvbox-dark-hard t)



(scroll-bar-mode -1)
(menu-bar-mode -1)
(tool-bar-mode -1)

(setq-default column-number-mode t)
(global-display-line-numbers-mode)

(setq-default tab-width 4)
(setq-default indent-tabs-mode t)
(setq-default backward-delete-char-untabify-method nil)

(setq-default make-backup-files nil)
(setq-default fill-column 140)

(custom-set-variables
 '(custom-safe-themes
   '("b1a691bb67bd8bd85b76998caf2386c9a7b2ac98a116534071364ed6489b695d" "fa49766f2acb82e0097e7512ae4a1d6f4af4d6f4655a48170d0a00bcb7183970" "3e374bb5eb46eb59dbd92578cae54b16de138bc2e8a31a2451bf6fdb0f3fd81b" "19a2c0b92a6aa1580f1be2deb7b8a8e3a4857b6c6ccf522d00547878837267e7" "2ff9ac386eac4dffd77a33e93b0c8236bb376c5a5df62e36d4bfa821d56e4e20" "72ed8b6bffe0bfa8d097810649fd57d2b598deef47c992920aef8b5d9599eefe" "d80952c58cf1b06d936b1392c38230b74ae1a2a6729594770762dc0779ac66b7" default))
 )

(setq-default ls-lisp-dirs-first t)

(setq org-todo-keywords
		'((sequence "TODO(t)" "IN-PROGRESS(i!)" "NEAR-COMP(n!)" "|" "DONE(d!)" "INCOMPLETE(c!)" "OVERDUE(o!)" "NEVER-DID(e)")
		  (sequence "BUG(b)" "MINOR" "MAJOR" "|" "FIXED(f@!)" "HOTFIX(h@!)")
		  (sequence "Heh")))

(setq org-todo-keyword-faces
	  '(("TODO" . org-warning) ("IN-PROGRESS" . "yellow") ("NEAR-COMP" . "orange") ("DONE" . "green")
		("BUG" . org-warning) ("FIXED" . "green")))

(setq org-src-preserve-indentation t)
(setq org-edit-src-content-indentation '0)

(setq org-agenda-span 'month)

(setq org-priority-highest '?A)
(setq org-priority-lowest '?E)
(setq org-priority-default '?C)



(setq c-default-style "stroustrup")











(setq-default ispell-program-name "C:/msys64/mingw64/bin/aspell.exe")



(add-hook 'prog-mode-hook
		  (lambda()
			(flyspell-prog-mode)
			(company-mode)
			(eglot-ensure)))











(add-hook 'org-mode-hook
		  'turn-on-auto-fill)





(add-hook 'text-mode-hook
		  (lambda ()
			(flyspell-mode)
			(flyspell-buffer)))

(add-hook 'window-setup-hook 'toggle-frame-maximized t)

(global-unset-key (kbd "C-f"))    ;; forward-char
(global-unset-key (kbd "C-b"))    ;; backward-char
(global-unset-key (kbd "C-n"))    ;; next-line
(global-unset-key (kbd "C-p"))    ;; previous-line

(global-unset-key (kbd "M-f"))    ;; forward-word
(global-unset-key (kbd "M-b"))    ;; backward-word
(global-unset-key (kbd "ESC <left>"))    ;; backward-word

(global-unset-key (kbd "M-a"))    ;; backward-sentence
(global-unset-key (kbd "M-e"))    ;; forward-sentence

;; (global-unset-key (kbd "C-M-f"))    ;; forward-sexp
;; (global-unset-key (kbd "C-M-<right>"))    ;; forward-sexp
;; (global-unset-key (kbd "ESC C-<left>"))    ;; backward-sexp
;; (global-unset-key (kbd "ESC C-<right>"))    ;; forward-sexp
;; (global-unset-key (kbd "C-M-b"))    ;; backward-sexp
;; (global-unset-key (kbd "C-M-<left>"))    ;; backward-sexp

;; (global-unset-key (kbd "C-x ["))    ;; backward-page
;; (global-unset-key (kbd "C-x ]"))    ;; forward-page

;; (global-unset-key (kbd "C-M-a"))    ;; beginning-of-defun
;; (global-unset-key (kbd "C-M-<home>"))    ;; beginning-of-defun
;; (global-unset-key (kbd "ESC C-<home>"))    ;; beginning-of-defun
;; (global-unset-key (kbd "C-M-e"))    ;; end-of-defun
;; (global-unset-key (kbd "C-M-<end>"))    ;; end-of-defun
;; (global-unset-key (kbd "ESC C-<end>"))    ;; end-of-defun

(global-unset-key (kbd "M-m"))    ;; back-to-indentation
(global-unset-key (kbd "M-i"))    ;; tab-to-tab-stop
