emacs/.emacs.d/init.el

(global-unset-key (kbd "C-v"))    ;; scroll-up-command
(global-unset-key (kbd "M-v"))    ;; scroll-down-command

;; (global-unset-key (kbd "M-<"))    ;; beginning-of-buffer
;; (global-unset-key (kbd "C-<home>"))    ;; beginning-of-buffer
;; (global-unset-key (kbd "M->"))    ;; end-of-buffer
;; (global-unset-key (kbd "C-<end>"))    ;; end-of-buffer

;; (global-unset-key (kbd "C-M-v"))    ;; scroll-other-window
;; (global-unset-key (kbd "M-<next>"))    ;; scroll-other-window
;; (global-unset-key (kbd "ESC <next>"))    ;; scroll-other-window
;; (global-unset-key (kbd "C-M-S-v"))    ;; scroll-other-window-down
;; (global-unset-key (kbd "M-<prior>"))    ;; scroll-other-window-down
;; (global-unset-key (kbd "ESC <prior>"))    ;; scroll-other-window-down

;; (global-unset-key (kbd "M-<home>"))    ;; beginning-of-buffer-other-window
;; (global-unset-key (kbd "M-<begin>"))    ;; beginning-of-buffer-other-window
;; (global-unset-key (kbd "ESC <home>"))    ;; beginning-of-buffer-other-window
;; (global-unset-key (kbd "ESC <begin>"))    ;; beginning-of-buffer-other-window
;; (global-unset-key (kbd "M-<end>"))    ;; end-of-buffer-other-window
;; (global-unset-key (kbd "ESC <end>"))    ;; end-of-buffer-other-window

;; (global-unset-key (kbd "C-M-S-l"))    ;; recenter-other-window

;; (global-unset-key (kbd "C-x <"))    ;; scroll-left
;; (global-unset-key (kbd "C-<next>"))    ;; scroll-left
;; (global-unset-key (kbd "C-x >"))    ;; scroll-right
;; (global-unset-key (kbd "C-<prior>"))    ;; scroll-right

;; (global-unset-key (kbd "M-<wheel-up>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "S-<wheel-up>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "S-<wheel-down>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "S-<wheel-left>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "M-<wheel-down>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "M-<wheel-left>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "M-<wheel-right>"))    ;; mwheel-scroll
;; (global-unset-key (kbd "S-<wheel-right>"))    ;; mwheel-scroll

;; (global-unset-key (kbd "C-M-d"))    ;; down-list
;; (global-unset-key (kbd "C-M-<down>"))    ;; down-list
;; (global-unset-key (kbd "ESC C-<down>"))    ;; down-list
;; (global-unset-key (kbd "C-M-n"))    ;; forward-list
;; (global-unset-key (kbd "C-M-p"))    ;; backward-list
;; (global-unset-key (kbd "C-M-u"))    ;; backward-up-list
;; (global-unset-key (kbd "C-M-<up>"))    ;; backward-up-list
;; (global-unset-key (kbd "ESC C-<up>"))    ;; backward-up-list

;; (global-unset-key (kbd "M-r"))    ;; move-to-window-line-top-bottom
;; (global-unset-key (kbd "C-M-l"))    ;; reposition-window

;; (global-unset-key (kbd "M-g c"))    ;; goto-char
;; (global-unset-key (kbd "M-g g"))    ;; goto-line
;; (global-unset-key (kbd "M-g M-g"))    ;; goto-line
;; (global-unset-key (kbd "C-x n g"))    ;; goto-line-relative

;; (global-unset-key (kbd "M-g TAB"))    ;; move-to-column

(global-set-key (kbd "C-<right>") 'forward-word)
(global-set-key (kbd "C-<left>") 'backward-word)

(global-set-key (kbd "C-M-<right>") 'forward-sentence)
(global-set-key (kbd "C-M-<left>") 'backward-sentence)

(global-set-key (kbd "C-M-<down>") 'forward-paragraph)
(global-set-key (kbd "C-M-<up>") 'backward-paragraph)

(global-set-key (kbd "C-{") 'beginning-of-defun)
(global-set-key (kbd "C-}") 'end-of-defun)

(global-set-key (kbd "C-<") 'back-to-indentation)
(global-set-key (kbd "C->") 'tab-to-tab-stop)

(global-set-key (kbd "C-S-k") 'up-list)
(global-set-key (kbd "C-S-j") 'backward-up-list)
(global-set-key (kbd "C-S-l") 'forward-list)
(global-set-key (kbd "C-S-h") 'backward-list)

(global-set-key (kbd "C-S-b") 'beginning-of-buffer)
(global-set-key (kbd "C-S-n") 'end-of-buffer)

(global-unset-key (kbd "M-w"))    ;; kill-ring-save
(global-unset-key (kbd "C-<insert>"))    ;; kill-ring-save
(global-unset-key (kbd "C-<insertchar>"))    ;; kill-ring-save
(global-unset-key (kbd "C-M-w"))    ;; append-next-kill

(global-unset-key (kbd "C-w"))    ;; kill-region
(global-unset-key (kbd "S-<delete>"))    ;; kill-region

(global-unset-key (kbd "M-d"))    ;; kill-word
(global-unset-key (kbd "M-DEL"))    ;; backward-kill-word

(global-unset-key (kbd "M-k"))    ;; kill-sentence
(global-unset-key (kbd "C-DEL"))    ;; backward-kill-sentence
(global-unset-key (kbd "C-x DEL"))    ;; backward-kill-sentence
(global-unset-key (kbd "C-S-<backspace>"))    ;; kill-whole-line
(global-unset-key (kbd "M-z"))    ;; zap-to-char

(global-unset-key (kbd "C-M-k"))    ;; kill-sexp
(global-unset-key (kbd "ESC C-<delete>"))    ;; backward-kill-sexp
(global-unset-key (kbd "ESC C-<backspace>"))    ;; backward-kill-sexp

(global-unset-key (kbd "C-y"))    ;; yank
(global-unset-key (kbd "S-<insert>"))    ;; yank
(global-unset-key (kbd "S-<insertchar>"))    ;; yank
(global-unset-key (kbd "M-y"))   ;; yank-pop

(global-unset-key (kbd "C-_"))    ;; undo
(global-unset-key (kbd "C-x u"))    ;; undo
(global-unset-key (kbd "C-M-_"))    ;; undo-redo

(global-unset-key (kbd "C-d"))    ;; delete-char

(global-unset-key (kbd "M-^"))    ;; delete-indentation
(global-unset-key (kbd "M-\\"))    ;; delete-horizontal-space
(global-unset-key (kbd "C-x C-o"))    ;; delete-blank-lines
(global-unset-key (kbd "M-SPC"))    ;; just-one-space

(global-unset-key (kbd "M-<down-mouse-1>"))    ;; mouse-drag-secondary
(global-unset-key (kbd "M-<drag-mouse-1>"))    ;; mouse-set-secondary
(global-unset-key (kbd "M-<mouse-1>"))    ;; mouse-start-secondary
(global-unset-key (kbd "M-<mouse-2>"))    ;; mouse-yank-secondary
(global-unset-key (kbd "M-<mouse-3>"))    ;; mouse-secondary-save-then-kill

(global-set-key (kbd "M-/") 'kill-ring-save)
(global-set-key (kbd "C-M-/") 'append-next-kill)

(global-set-key (kbd "M-.") 'kill-region)

;(global-set-key (kbd "C-M-h") 'backward-kill-word)
;(global-set-key (kbd "C-M-j") 'kill-word)

(global-set-key (kbd "C-M-k") 'backward-kill-sentence)
(global-set-key (kbd "C-M-l") 'kill-sentence)
(global-set-key (kbd "C-M-n") 'kill-whole-line)

(global-set-key (kbd "M-;") 'yank)
(global-set-key (kbd "M-'") 'yank-pop)

(global-set-key (kbd "C-M-y") 'delete-indentation)
(global-set-key (kbd "C-M-u") 'delete-horizontal-space)
(global-set-key (kbd "C-M-b") 'delete-blank-lines)
(global-set-key (kbd "C-M-p") 'just-one-space)

(define-prefix-command 'mark-prfx)
(global-set-key (kbd "M-SPC") 'mark-prfx)

(global-unset-key (kbd "C-@"))    ;; set-mark-command
(global-unset-key (kbd "C-x C-x"))    ;; exchange-point-and-mark
