emacs/.emacs.d/init.org
******* General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-@"))    ;; mark-word
(global-unset-key (kbd "C-M-h"))    ;; mark-defun
(global-unset-key (kbd "C-x h"))    ;; mark-whole-buffer
(global-unset-key (kbd "C-x C-p"))    ;; mark-page
#+END_SRC

******* Moisty
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-M-@"))    ;; mark-sexp
(global-unset-key (kbd "C-M-SPC"))    ;; mark-sexp
#+END_SRC

****** Popping
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-,"))    ;; xref-pop-marker-stack
(global-unset-key (kbd "C-x C-@"))    ;; pop-global-mark
(global-unset-key (kbd "C-x C-SPC"))    ;; pop-global-mark
#+END_SRC

***** Binded
****** Setting
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-SPC M-SPC") 'exchange-point-and-mark)
#+END_SRC

****** Chunks
******* General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-SPC w") 'mark-word)
(global-set-key (kbd "M-SPC d") 'mark-defun)
(global-set-key (kbd "M-SPC C-a") 'mark-whole-buffer)
#+END_SRC

******* Expressions
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-SPC s") 'mark-sexp)
#+END_SRC

****** Popping
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-SPC x") 'xref-pop-marker-stack)
(global-set-key (kbd "M-SPC p") 'pop-global-mark)
#+END_SRC

**** Rectangles
***** Unbinded
****** Setting
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x SPC"))    ;; rectangle-mark-mode
#+END_SRC

****** Clipboard
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x r y"))    ;; yank-rectangle
(global-unset-key (kbd "C-x r k"))    ;; kill-rectangle
#+END_SRC

****** Utilization
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x r c"))    ;; clear-rectangle
(global-unset-key (kbd "C-x r o"))    ;; open-rectangle
(global-unset-key (kbd "C-x r t"))    ;; string-rectangle
(global-unset-key (kbd "C-x r d"))    ;; delete-rectangle
#+END_SRC

****** ExTra ExTra
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x r N"))    ;; rectangle-number-lines
(global-unset-key (kbd "C-x r r"))    ;; copy-rectangle-to-register
#+END_SRC

***** Binded
****** Setting
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-SPC") 'rectangle-mark-mode)
#+END_SRC

**** Searching
I would like to go with C-s, but that was taken by isearch-forward already. Tried to remap it but the command already had some specifics to it that
wouldn't allow rebinding a practical possibility.
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'search-prfx)
(global-set-key (kbd "M-s") 'search-prfx)
#+END_SRC

***** Unbinded
****** Files
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x C-v"))    ;; find-alternate-file
(global-unset-key (kbd "C-x C-r"))    ;; find-file-read-only
#+END_SRC

****** Xref
#+BEGIN_SRC emacs-lisp
;;(global-unset-key (kbd "M-."))    ;; xref-find-definitions
(global-unset-key (kbd "M-?"))    ;; xref-find-references
(global-unset-key (kbd "C-M-."))    ;; xref-find-apropos
#+END_SRC

****** Regexp
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-M-r"))    ;; isearch-backward-regexp
(global-unset-key (kbd "C-M-s"))    ;; isearch-forward-regexp
#+END_SRC

****** Replace
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-%"))    ;; query-replace
(global-unset-key (kbd "C-M-%"))    ;; query-replace-regexp
#+END_SRC

***** Binded
****** Files
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-s C-f") 'find-alternate-file)
#+END_SRC

****** Xref
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-s ?") 'xref-find-definitions)
(global-set-key (kbd "M-s C-?") 'xref-find-references)
#+END_SRC

****** Replace
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-s r") 'query-replace)
(global-set-key (kbd "M-s R") 'query-replace-regexp)
#+END_SRC

**** Highlighting
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'hi-prfx)
(global-set-key (kbd "M-l") 'hi-prfx)
#+END_SRC

***** Unbinded
****** General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-s h ."))    ;; highlight-symbol-at-point
(global-unset-key (kbd "M-s h p"))    ;; highlight-phrase
#+END_SRC

****** Regexp
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-s h r"))    ;; highlight-regexp
(global-unset-key (kbd "M-s h l"))    ;; highlight-lines-matching-regexp
(global-unset-key (kbd "M-s h u"))    ;; unhighlight-regexp
#+END_SRC

****** Hi-Lock
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-s h f"))    ;; hi-lock-find-patterns
(global-unset-key (kbd "M-s h w"))    ;; hi-lock-write-interactive-patterns
#+END_SRC

***** Binded
****** General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-l h") 'highlight-symbol-at-point)
(global-set-key (kbd "M-l p") 'highlight-phrase)
#+END_SRC

****** Regexp
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-l x") 'highlight-regexp)
(global-set-key (kbd "M-l l") 'highlight-lines-matching-regexp)
(global-set-key (kbd "M-l u") 'unhighlight-regexp)
#+END_SRC

**** Manipulation
Commands that manipulate the style of the text (e.g., Cases) and the position of the text (e.g., Transposing, Splitting). Setting up this header was one of the harder one's to try
and categorize as I had trouble of what would belong here as a lot of commands do some sort of "manipulation" of text.

***** Unbinding
****** Straights
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-M-o"))    ;; split-line
#+END_SRC

****** Transposing
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-t"))    ;; transpose-chars
(global-unset-key (kbd "M-t"))    ;; transpose-words
(global-unset-key (kbd "C-x C-t"))    ;; transpose-lines
#+END_SRC

****** Cases
******* Words
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-l"))    ;; downcase-word
(global-unset-key (kbd "M-u"))    ;; upcase-word
(global-unset-key (kbd "M-c"))    ;; capitalize-word
#+END_SRC

******* Regions
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x C-l"))    ;; downcase-region
(global-unset-key (kbd "C-x C-u"))    ;; upcase-region
#+END_SRC

***** Binding
****** Transposing
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-r") 'transpose-chars)
(global-set-key (kbd "C-x C-t") 'transpose-words)
(global-set-key (kbd "C-x C-y") 'transpose-lines)
(global-set-key (kbd "C-x C-u") 'transpose-sentences)
#+END_SRC

**** Indenting
Used M-i because 1) indenting wouldn't be often used, hence the Meta stroke, and 2) felt that C-i would probably cause problems if I did ever use it; it's also just slightly easier
to type M-i.

#+BEGIN_SRC emacs-lisp
(define-prefix-command 'indent-prfx)
(global-set-key (kbd "M-i") 'indent-prfx)
#+END_SRC

***** Unbinded
****** Newline
Even though the GNU Emacs manual states that M-j and C-M-j are mapped to comment-indent-new-line, default-indent-new-line can deliver the same features.
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-j"))    ;; default-indent-new-line
(global-unset-key (kbd "C-M-j"))    ;; default-indent-new-line
#+END_SRC

****** Formatting
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x TAB"))    ;; indent-rigidly
(global-unset-key (kbd "C-M-\\"))    ;; indent-region
(global-unset-key (kbd "M-)"))    ;; move-past-close-and-reindent
#+END_SRC

***** Binded
****** Newline
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-i RET") 'default-indent-new-line)
#+END_SRC

****** Formatting
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-i TAB") 'indent-rigidly)
(global-set-key (kbd "M-i r") 'indent-region)
(global-set-key (kbd "M-i c") 'move-past-close-and-reindent)
#+END_SRC

**** Comments
***** Unbinded
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x ;"))    ;; comment-set-column
;;(global-unset-key (kbd "M-;"))    ;; comment-dwim
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x ;") 'comment-dwim)
#+END_SRC

**** Other
***** Unbinded
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-q"))    ;; quoted-insert
(global-unset-key (kbd "C-x C-d"))    ;; list-directory
#+END_SRC

*** Display Management
**** Frames
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'frames-prfx)
(global-set-key (kbd "C-f") 'frames-prfx)
#+END_SRC

***** Unbinded
****** Management
******* Adjustment
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-<f10>"))    ;; toggle-frame-maximized
(global-unset-key (kbd "ESC <f10>"))    ;; toggle-frame-maximized
#+END_SRC

******* Creation
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 5 2"))    ;; make-frame-command
(global-unset-key (kbd "C-x 5 c"))    ;; clone-frame
#+END_SRC

******* Deletion
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 5 0"))    ;; delete-frame
(global-unset-key (kbd "C-x 5 1"))    ;; delete-other-frames
#+END_SRC

******* Suspend
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-z"))    ;; suspend-frame
(global-unset-key (kbd "C-x z"))    ;; suspend-frame
(global-unset-key (kbd "C-x C-z"))    ;; suspend-frame
#+END_SRC

****** Other Frame
******* General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 5 5"))    ;; other-frame-prefix
(global-unset-key (kbd "C-x 5 C-o"))    ;; display-buffer-other-frame
(global-unset-key (kbd "C-x 5 m"))    ;; compose-mail-other-frame
(global-unset-key (kbd "C-x 5 p"))    ;; project-other-frame-command
(global-unset-key (kbd "C-<drag-n-drop>"))    ;; w32-drag-n-drop-other-frame
#+END_SRC

******* Switching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 5 o"))    ;; other-frame
(global-unset-key (kbd "C-x 5 b"))    ;; switch-to-buffer-other-frame
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 5 C-f"))    ;; find-file-other-frame
(global-unset-key (kbd "C-x 5 ."))    ;; xref-find-definitions-other-frame
(global-unset-key (kbd "C-x 5 f"))    ;; find-file-other-frame
(global-unset-key (kbd "C-x 5 r"))    ;; find-file-read-only-other-frame
(global-unset-key (kbd "C-x 5 d"))    ;; dired-other-frame
#+END_SRC

***** Binded
****** Management
******* Creation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-f f") 'make-frame-command)
(global-set-key (kbd "C-f F") 'clone-frame)
#+END_SRC

