emacs/.emacs.d/init.org
******* Deletion
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-f w") 'delete-frame)
(global-set-key (kbd "C-f 1") 'delete-other-frames)
#+END_SRC

****** Other Frame
******* General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-f 5") 'other-frame-prefix)
(global-set-key (kbd "C-f C-b") 'display-buffer-other-frame)
#+END_SRC

******* Switching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-f o") 'other-frame)
(global-set-key (kbd "C-f b") 'switch-to-buffer-other-frame)
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-f C-f") 'find-file-other-frame)
(global-set-key (kbd "C-f d") 'dired-other-frame)
#+END_SRC

**** Windows
#+BEGIN_SRC emacs-lisp
(windmove-default-keybindings)
(define-prefix-command 'windows-prfx)
(global-set-key (kbd "C-w") 'windows-prfx)
#+END_SRC

***** Unbinded
****** Management
******* Adjustment
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x +"))    ;; balance-windows
(global-unset-key (kbd "C-x ^"))    ;; enlarge-window
(global-unset-key (kbd "C-x }"))    ;; enlarge-window-horizontally
(global-unset-key (kbd "C-x {"))    ;; shrink-window-horizontally
(global-unset-key (kbd "C-x -"))    ;; shrink-window-if-larger-than-buffer
#+END_SRC

******* Splitting
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 2"))    ;; split-window-below
(global-unset-key (kbd "C-x 3"))    ;; split-window-right
#+END_SRC

******* Deletion
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 0"))    ;; delete-window
(global-unset-key (kbd "C-x 1"))    ;; delete-other-windows
(global-unset-key (kbd "C-x 4 0"))    ;; kill-buffer-and-window
#+END_SRC

****** Other Window
******* General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 4 4"))    ;; other-window-prefix
(global-unset-key (kbd "C-x 4 C-o"))    ;; display-buffer
(global-unset-key (kbd "C-x 4 c"))    ;; clone-indirect-buffer-other-window
(global-unset-key (kbd "C-x 4 a"))    ;; add-change-log-entry-other-window
(global-unset-key (kbd "C-x 4 m"))    ;; compose-mail-other-window
(global-unset-key (kbd "C-x 4 p"))    ;; project-other-window-command
#+END_SRC

******* Switching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x o"))    ;; other-window
(global-unset-key (kbd "C-x 4 b"))    ;; switch-to-buffer-other-window
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 4 C-f"))    ;; find-file-other-window
(global-unset-key (kbd "C-x 4 C-j"))    ;; dired-jump-other-window
(global-unset-key (kbd "C-x 4 ."))    ;; xref-find-definitions-other-window
(global-unset-key (kbd "C-x 4 d"))    ;; dired-other-window
(global-unset-key (kbd "C-x 4 f"))    ;; find-file-other-window
(global-unset-key (kbd "C-x 4 r"))    ;; find-file-read-only-other-window
#+END_SRC

******* Uno Reverse
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x 4 1"))    ;; same-window-prefix
#+END_SRC

****** 2C
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "<f2>"))    ;; 2C-command
(global-unset-key (kbd "<f2> 2"))    ;; 2C-two-columns
(global-unset-key (kbd "<f2> b"))    ;; 2C-associate-buffer
(global-unset-key (kbd "<f2> s"))    ;; 2C-split
(global-unset-key (kbd "<f2> <f2>"))    ;; 2C-two-columns
(global-unset-key (kbd "C-x 6 2"))    ;; 2C-two-columns
(global-unset-key (kbd "C-x 6 b"))    ;; 2C-associate-buffer
(global-unset-key (kbd "C-x 6 s"))    ;; 2C-split
(global-unset-key (kbd "C-x 6 <f2>"))    ;; 2C-two-columns
#+END_SRC

***** Binded
****** Management
******* Adjustment
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w =") 'balance-windows)
(global-set-key (kbd "C-w C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "C-w C-<up>") 'enlarge-window)
(global-set-key (kbd "C-w C-<right>") 'enlarge-window-horizontally)
#+END_SRC

******* Splitting
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w [") 'split-window-below)
(global-set-key (kbd "C-w ]") 'split-window-right)
#+END_SRC

******* Deletion
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w w") 'delete-window)
(global-set-key (kbd "C-w W") 'delete-other-windows)
(global-set-key (kbd "C-w C-w") 'kill-buffer-and-window)
#+END_SRC

****** Other Window
******* General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w b") 'display-buffer)
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w C-f") 'find-file-other-window)
(global-set-key (kbd "C-w C-d") 'dired-jump-other-window)
(global-set-key (kbd "C-w B") 'switch-to-buffer-other-window)
(global-set-key (kbd "C-w c") 'clone-indirect-buffer-other-window)
(global-set-key (kbd "C-w d") 'dired-other-window)
#+END_SRC

******* Uno Reverse
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-w 4") 'same-window-prefix)
#+END_SRC

**** Buffers
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'buffers-prfx)
(global-set-key (kbd "C-b") 'buffers-prfx)
#+END_SRC

***** Functions
When called, I can continuously press [ or ] to switch between buffers.
#+BEGIN_SRC emacs-lisp
(defun buffer-continous-switch()
  )
#+END_SRC

***** Unbinded
****** Switching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x b"))    ;; switch-to-buffer
(global-unset-key (kbd "C-x <right>"))    ;; next-buffer
(global-unset-key (kbd "C-x C-<right>"))    ;; next-buffer
(global-unset-key (kbd "C-x <left>"))    ;; previous-buffer
(global-unset-key (kbd "C-x C-<left>"))    ;; previous-buffer
#+END_SRC

****** Management
******* General
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x s"))    ;; save-some-buffers
;; (global-unset-key (kbd "C-x C-b"))    ;; list-buffers
;; (global-unset-key (kbd "C-x C-q"))    ;; read-only-mode
#+END_SRC

******* Creation
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x x n"))    ;; clone-buffer
#+END_SRC

******* Killing
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x k"))    ;; kill-buffer
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x x g"))    ;; revert-buffer-quick
(global-unset-key (kbd "C-x x r"))    ;; rename-buffer
(global-unset-key (kbd "C-x x u"))    ;; rename-uniquely
(global-unset-key (kbd "C-x x i"))    ;; insert-buffer
#+END_SRC

***** Binded
****** Switching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-b C-<left>") 'previous-buffer)
(global-set-key (kbd "C-b C-<right>") 'next-buffer)
#+END_SRC

****** Management
******* General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-b s") 'save-some-buffers)
(global-set-key (kbd "C-b l") 'list-buffers)
#+END_SRC

******* Killing
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-b k") 'kill-buffer)
(global-set-key (kbd "C-b x") 'save-buffers-kill-terminal)
#+END_SRC

**** Tabs
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'tabs-prfx)
(global-set-key (kbd "C-t") 'tabs-prfx)
#+END_SRC

***** Unbinding
****** Management
******* Organize
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t G"))    ;; tab-group
;; (global-unset-key (kbd "C-x t r"))    ;; tab-rename
#+END_SRC

******* Creation
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t 2"))    ;; tab-new
;; (global-unset-key (kbd "C-x t n"))    ;; tab-duplicate
#+END_SRC

******* Deletion
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t 0"))    ;; tab-close
;; (global-unset-key (kbd "C-x t 1"))    ;; tab-close-other
#+END_SRC

******* Recover
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t u"))    ;; tab-undo
#+END_SRC

****** Switching
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t o"))    ;; tab-next
;; (global-unset-key (kbd "C-x t O"))    ;; tab-previous
#+END_SRC

****** Movement
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t N"))      ;; tab-new-to
;; (global-unset-key (kbd "C-x t M"))      ;; tab-move-to
;; (global-unset-key (kbd "C-x t RET"))    ;; tab-switch
;; (global-unset-key (kbd "C-x t m"))      ;; tab-move
#+END_SRC

****** Other Tab
******* General
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t t"))    ;; other-tab-prefix
;; (global-unset-key (kbd "C-x t b"))    ;; switch-to-buffer-other-tab
;; (global-unset-key (kbd "C-x t p"))    ;; project-other-tab-command
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x t C-f"))    ;; find-file-other-tab
;; (global-unset-key (kbd "C-x t f"))      ;; find-file-other-tab
;; (global-unset-key (kbd "C-x t C-r"))    ;; find-file-read-only-other-tab
;; (global-unset-key (kbd "C-x t d"))      ;; dired-other-tab
#+END_SRC

***** Binding
****** Management
******* Creation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-t t") 'tab-new)
(global-set-key (kbd "C-t D") 'tab-duplicate)
#+END_SRC

******* Deletion
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-t w") 'tab-close)
(global-set-key (kbd "C-t W") 'tab-close-other)
#+END_SRC

******* Recover
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-t u") 'tab-undo)
#+END_SRC

****** Other Tab
******* General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-t p") 'project-other-tab-command)
#+END_SRC

******* Searching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-t d") 'dired-other-tab)
(global-set-key (kbd "C-t C-f") 'find-file-other-tab)
#+END_SRC

*** Project Management
**** Version Control
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'vcs-prfx)
(global-set-key (kbd "C-v") 'vcs-prfx)
#+END_SRC

***** Unbinding
****** General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v d"))    ;; vc-dir
#+END_SRC

****** Initialization
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v i"))    ;; vc-register
#+END_SRC

****** Management
