emacs/.emacs.d/init.el

(global-set-key (kbd "C-f w") 'delete-frame)
(global-set-key (kbd "C-f 1") 'delete-other-frames)

(global-set-key (kbd "C-f 5") 'other-frame-prefix)
(global-set-key (kbd "C-f C-b") 'display-buffer-other-frame)

(global-set-key (kbd "C-f o") 'other-frame)
(global-set-key (kbd "C-f b") 'switch-to-buffer-other-frame)

(global-set-key (kbd "C-f C-f") 'find-file-other-frame)
(global-set-key (kbd "C-f d") 'dired-other-frame)

(windmove-default-keybindings)
(define-prefix-command 'windows-prfx)
(global-set-key (kbd "C-w") 'windows-prfx)

(global-unset-key (kbd "C-x +"))    ;; balance-windows
(global-unset-key (kbd "C-x ^"))    ;; enlarge-window
(global-unset-key (kbd "C-x }"))    ;; enlarge-window-horizontally
(global-unset-key (kbd "C-x {"))    ;; shrink-window-horizontally
(global-unset-key (kbd "C-x -"))    ;; shrink-window-if-larger-than-buffer

(global-unset-key (kbd "C-x 2"))    ;; split-window-below
(global-unset-key (kbd "C-x 3"))    ;; split-window-right

(global-unset-key (kbd "C-x 0"))    ;; delete-window
(global-unset-key (kbd "C-x 1"))    ;; delete-other-windows
(global-unset-key (kbd "C-x 4 0"))    ;; kill-buffer-and-window

(global-unset-key (kbd "C-x 4 4"))    ;; other-window-prefix
(global-unset-key (kbd "C-x 4 C-o"))    ;; display-buffer
(global-unset-key (kbd "C-x 4 c"))    ;; clone-indirect-buffer-other-window
(global-unset-key (kbd "C-x 4 a"))    ;; add-change-log-entry-other-window
(global-unset-key (kbd "C-x 4 m"))    ;; compose-mail-other-window
(global-unset-key (kbd "C-x 4 p"))    ;; project-other-window-command

(global-unset-key (kbd "C-x o"))    ;; other-window
(global-unset-key (kbd "C-x 4 b"))    ;; switch-to-buffer-other-window

(global-unset-key (kbd "C-x 4 C-f"))    ;; find-file-other-window
(global-unset-key (kbd "C-x 4 C-j"))    ;; dired-jump-other-window
(global-unset-key (kbd "C-x 4 ."))    ;; xref-find-definitions-other-window
(global-unset-key (kbd "C-x 4 d"))    ;; dired-other-window
(global-unset-key (kbd "C-x 4 f"))    ;; find-file-other-window
(global-unset-key (kbd "C-x 4 r"))    ;; find-file-read-only-other-window

(global-unset-key (kbd "C-x 4 1"))    ;; same-window-prefix

(global-unset-key (kbd "<f2>"))    ;; 2C-command
(global-unset-key (kbd "<f2> 2"))    ;; 2C-two-columns
(global-unset-key (kbd "<f2> b"))    ;; 2C-associate-buffer
(global-unset-key (kbd "<f2> s"))    ;; 2C-split
(global-unset-key (kbd "<f2> <f2>"))    ;; 2C-two-columns
(global-unset-key (kbd "C-x 6 2"))    ;; 2C-two-columns
(global-unset-key (kbd "C-x 6 b"))    ;; 2C-associate-buffer
(global-unset-key (kbd "C-x 6 s"))    ;; 2C-split
(global-unset-key (kbd "C-x 6 <f2>"))    ;; 2C-two-columns

(global-set-key (kbd "C-w =") 'balance-windows)
(global-set-key (kbd "C-w C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "C-w C-<up>") 'enlarge-window)
(global-set-key (kbd "C-w C-<right>") 'enlarge-window-horizontally)

(global-set-key (kbd "C-w [") 'split-window-below)
(global-set-key (kbd "C-w ]") 'split-window-right)

(global-set-key (kbd "C-w w") 'delete-window)
(global-set-key (kbd "C-w W") 'delete-other-windows)
(global-set-key (kbd "C-w C-w") 'kill-buffer-and-window)

(global-set-key (kbd "C-w b") 'display-buffer)

(global-set-key (kbd "C-w C-f") 'find-file-other-window)
(global-set-key (kbd "C-w C-d") 'dired-jump-other-window)
(global-set-key (kbd "C-w B") 'switch-to-buffer-other-window)
(global-set-key (kbd "C-w c") 'clone-indirect-buffer-other-window)
(global-set-key (kbd "C-w d") 'dired-other-window)

(global-set-key (kbd "C-w 4") 'same-window-prefix)

(define-prefix-command 'buffers-prfx)
(global-set-key (kbd "C-b") 'buffers-prfx)

(defun buffer-continous-switch()
  )

(global-unset-key (kbd "C-x b"))    ;; switch-to-buffer
(global-unset-key (kbd "C-x <right>"))    ;; next-buffer
(global-unset-key (kbd "C-x C-<right>"))    ;; next-buffer
(global-unset-key (kbd "C-x <left>"))    ;; previous-buffer
(global-unset-key (kbd "C-x C-<left>"))    ;; previous-buffer

;; (global-unset-key (kbd "C-x s"))    ;; save-some-buffers
;; (global-unset-key (kbd "C-x C-b"))    ;; list-buffers
;; (global-unset-key (kbd "C-x C-q"))    ;; read-only-mode

;; (global-unset-key (kbd "C-x x n"))    ;; clone-buffer

;; (global-unset-key (kbd "C-x k"))    ;; kill-buffer

(global-unset-key (kbd "C-x x g"))    ;; revert-buffer-quick
(global-unset-key (kbd "C-x x r"))    ;; rename-buffer
(global-unset-key (kbd "C-x x u"))    ;; rename-uniquely
(global-unset-key (kbd "C-x x i"))    ;; insert-buffer

(global-set-key (kbd "C-b C-<left>") 'previous-buffer)
(global-set-key (kbd "C-b C-<right>") 'next-buffer)

(global-set-key (kbd "C-b s") 'save-some-buffers)
(global-set-key (kbd "C-b l") 'list-buffers)

(global-set-key (kbd "C-b k") 'kill-buffer)
(global-set-key (kbd "C-b x") 'save-buffers-kill-terminal)

(define-prefix-command 'tabs-prfx)
(global-set-key (kbd "C-t") 'tabs-prfx)

;; (global-unset-key (kbd "C-x t G"))    ;; tab-group
;; (global-unset-key (kbd "C-x t r"))    ;; tab-rename

;; (global-unset-key (kbd "C-x t 2"))    ;; tab-new
;; (global-unset-key (kbd "C-x t n"))    ;; tab-duplicate

;; (global-unset-key (kbd "C-x t 0"))    ;; tab-close
;; (global-unset-key (kbd "C-x t 1"))    ;; tab-close-other

;; (global-unset-key (kbd "C-x t u"))    ;; tab-undo

;; (global-unset-key (kbd "C-x t o"))    ;; tab-next
;; (global-unset-key (kbd "C-x t O"))    ;; tab-previous

;; (global-unset-key (kbd "C-x t N"))      ;; tab-new-to
;; (global-unset-key (kbd "C-x t M"))      ;; tab-move-to
;; (global-unset-key (kbd "C-x t RET"))    ;; tab-switch
;; (global-unset-key (kbd "C-x t m"))      ;; tab-move

;; (global-unset-key (kbd "C-x t t"))    ;; other-tab-prefix
;; (global-unset-key (kbd "C-x t b"))    ;; switch-to-buffer-other-tab
;; (global-unset-key (kbd "C-x t p"))    ;; project-other-tab-command

;; (global-unset-key (kbd "C-x t C-f"))    ;; find-file-other-tab
;; (global-unset-key (kbd "C-x t f"))      ;; find-file-other-tab
;; (global-unset-key (kbd "C-x t C-r"))    ;; find-file-read-only-other-tab
;; (global-unset-key (kbd "C-x t d"))      ;; dired-other-tab

(global-set-key (kbd "C-t t") 'tab-new)
(global-set-key (kbd "C-t D") 'tab-duplicate)

(global-set-key (kbd "C-t w") 'tab-close)
(global-set-key (kbd "C-t W") 'tab-close-other)

(global-set-key (kbd "C-t u") 'tab-undo)

(global-set-key (kbd "C-t p") 'project-other-tab-command)

(global-set-key (kbd "C-t d") 'dired-other-tab)
(global-set-key (kbd "C-t C-f") 'find-file-other-tab)

(define-prefix-command 'vcs-prfx)
(global-set-key (kbd "C-v") 'vcs-prfx)

(global-unset-key (kbd "C-x v d"))    ;; vc-dir

(global-unset-key (kbd "C-x v i"))    ;; vc-register

(global-unset-key (kbd "C-x v v"))    ;; vc-next-action
