emacs/.emacs.d/init.org
******* Updating
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v v"))    ;; vc-next-action
(global-unset-key (kbd "C-x v +"))    ;; vc-update
(global-unset-key (kbd "C-x v P"))    ;; vc-push
(global-unset-key (kbd "C-x v m"))    ;; vc-merge
(global-unset-key (kbd "C-x v u"))    ;; vc-revert
#+END_SRC

******* Removal
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v G"))    ;; vc-ignore
(global-unset-key (kbd "C-x v x"))    ;; vc-delete-file
#+END_SRC

****** Records
******* Diffs
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v ="))    ;; vc-diff
(global-unset-key (kbd "C-x v D"))    ;; vc-root-diff
(global-unset-key (kbd "C-x v M D"))    ;; vc-diff-mergebase
#+END_SRC

******* Logs
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v l"))    ;; vc-print-log
(global-unset-key (kbd "C-x v L"))    ;; vc-print-root-log
(global-unset-key (kbd "C-x v O"))    ;; vc-log-outgoing
(global-unset-key (kbd "C-x v I"))    ;; vc-log-incoming
(global-unset-key (kbd "C-x v h"))    ;; vc-region-history
(global-unset-key (kbd "C-x v M L"))    ;; vc-log-mergebase
(global-unset-key (kbd "C-x v a"))    ;; vc-annotate
(global-unset-key (kbd "C-x v g"))    ;; vc-annotate
(global-unset-key (kbd "C-x v ~"))    ;; vc-revision-other-window
#+END_SRC

******* Logging
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v s"))    ;; vc-create-tag
(global-unset-key (kbd "C-x v r"))    ;; vc-retrieve-tag
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x v b"))    ;; vc-switch-backend
#+END_SRC

***** Binding
****** General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v d") 'vc-dir)
#+END_SRC

****** Initialization
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v M-i") 'vc-register)
#+END_SRC

****** Management
******* Updating
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v v") 'vc-next-action)
(global-set-key (kbd "C-v p") 'vc-push)
(global-set-key (kbd "C-v P") 'vc-update)
(global-set-key (kbd "C-v M") 'vc-merge)
(global-set-key (kbd "C-v U") 'vc-revert)
#+END_SRC

******* Removal
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v x") 'vc-ignore)
(global-set-key (kbd "C-v C-x") 'vc-delete-file)
#+END_SRC

****** Records
******* Diffs
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v D") 'vc-diff)
(global-set-key (kbd "C-v C-d") 'vc-root-diff)
#+END_SRC

******* Logs
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v C-p") 'vc-print-log)
(global-set-key (kbd "C-v C-l") 'vc-print-root-log)
(global-set-key (kbd "C-v l") 'vc-log-outgoing)
(global-set-key (kbd "C-v L") 'vc-log-incoming)
(global-set-key (kbd "C-v h") 'vc-region-history)
(global-set-key (kbd "C-v a") 'vc-annotate)
(global-set-key (kbd "C-v r") 'vc-revision-other-window)
#+END_SRC

******* Tags
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-v t") 'vc-create-tag)
(global-set-key (kbd "C-v C-t") 'vc-retrieve-tag)
#+END_SRC

**** Projects
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'project-prfx)
(global-set-key (kbd "C-p") 'project-prfx)
#+END_SRC

***** Unbinding
****** General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x p D"))    ;; project-dired
(global-unset-key (kbd "C-x p v"))    ;; project-vc-dir
(global-unset-key (kbd "C-x p b"))    ;; project-switch-to-buffer
(global-unset-key (kbd "C-x p k"))    ;; project-kill-buffers
(global-unset-key (kbd "C-x p p"))    ;; project-switch-project
#+END_SRC

****** Commando
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x p s"))    ;; project-shell
(global-unset-key (kbd "C-x p !"))    ;; project-shell-command
(global-unset-key (kbd "C-x p &"))    ;; project-async-shell-command
(global-unset-key (kbd "C-x p e"))    ;; project-eshell
(global-unset-key (kbd "C-x p x"))    ;; project-execute-extended-command
(global-unset-key (kbd "C-x p c"))    ;; project-compile
#+END_SRC

****** Searching
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x p f"))    ;; project-find-file
(global-unset-key (kbd "C-x p g"))    ;; project-find-regexp
(global-unset-key (kbd "C-x p d"))    ;; project-find-dir
(global-unset-key (kbd "C-x p F"))    ;; project-or-external-find-file
(global-unset-key (kbd "C-x p G"))    ;; project-or-external-find-regexp
(global-unset-key (kbd "C-x p r"))    ;; project-query-replace-regexp
#+END_SRC

***** Binding
****** General
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-p d") 'project-dired)
(global-set-key (kbd "C-p D") 'project-vc-dir)
(global-set-key (kbd "C-p b") 'project-switch-to-buffer)
(global-set-key (kbd "C-p C-k") 'project-kill-buffers)
(global-set-key (kbd "C-p p") 'project-switch-project)
#+END_SRC

****** Commando
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-p s") 'project-shell)
(global-set-key (kbd "C-p S") 'project-shell-command)
(global-set-key (kbd "C-p C-s") 'project-async-shell-command)
(global-set-key (kbd "C-p e") 'project-eshell)
(global-set-key (kbd "C-p c") 'project-compile)
#+END_SRC

****** Searching
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-p C-f") 'project-find-file)
(global-set-key (kbd "C-p g") 'project-find-regexp)
(global-set-key (kbd "C-p d") 'project-find-dir)
(global-set-key (kbd "C-p r") 'project-query-replace-regexp)
#+END_SRC

**** Compilation
***** Unbinded
****** Errors
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x `"))    ;; next-error
(global-unset-key (kbd "M-g M-n"))    ;; next-error
(global-unset-key (kbd "M-g n"))    ;; next-error
(global-unset-key (kbd "M-g M-p"))    ;; previous-error
(global-unset-key (kbd "M-g p"))    ;; previous-error
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Eldoc
#+BEGIN_SRC emacs-lisp

#+END_SRC

*** Quality of Life
**** Abbrev
***** Unbinded
****** Creation
******* Global
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x a g"))    ;; add-global-abbrev
;; (global-unset-key (kbd "C-x a -"))    ;; inverse-add-global-abbrev
;; (global-unset-key (kbd "C-x a i g"))    ;; inverse-add-global-abbrev
#+END_SRC

******* Local
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x a +"))    ;; add-mode-abbrev
;; (global-unset-key (kbd "C-x a l"))    ;; add-mode-abbrev
;; (global-unset-key (kbd "C-x a C-a"))    ;; add-mode-abbrev
;; (global-unset-key (kbd "C-x a i l"))    ;; inverse-add-mode-abbrev
#+END_SRC

****** Expansion
#+BEGIN_SRC emacs-lisp
;;(global-unset-key (kbd "M-/"))    ;; abbrev-expand
;; (global-unset-key (kbd "C-x '"))    ;; expand-abbrev
;; (global-unset-key (kbd "C-x a '"))    ;; expand-abbrev
;; (global-unset-key (kbd "C-x a e"))    ;; expand-abbrev
;; (global-unset-key (kbd "C-x a n"))    ;; expand-jump-to-next-slot
;; (global-unset-key (kbd "C-x a p"))    ;; expand-jump-to-previous-slot
#+END_SRC

****** Completion
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-M-/"))    ;; dabbrev-completion
#+END_SRC

***** Binded
****** Expansion
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "M-a /") 'abbrev-expand)
;; (global-set-key (kbd "M-a e") 'expand-abbrev)
;; (global-set-key (kbd "M-a n") 'expand-jump-to-next-slot)
;; (global-set-key (kbd "M-a p") 'expand-jump-to-previous-slot)
#+END_SRC

****** Completion
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "M-a C-/") 'dabbrev-completion)
#+END_SRC

**** Registers
#+BEGIN_SRC emacs-lisp
;; (define-prefix-command 'register-prfx)
;; (global-set-key (kbd "C-M-r") 'register-prfx)
#+END_SRC

***** Unbinded
****** Manipulation
******* Storing
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r C-@"))    ;; point-to-register
;; (global-unset-key (kbd "C-x r C-SPC"))    ;; point-to-register
;; (global-unset-key (kbd "C-x r SPC"))    ;; point-to-register
;; (global-unset-key (kbd "C-x r n"))    ;; number-to-register
#+END_SRC

******* Copying
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r s"))    ;; copy-to-register
;; (global-unset-key (kbd "C-x r x"))    ;; copy-to-register
#+END_SRC

******* Values
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r +"))    ;; increment-register
#+END_SRC

****** Insertion
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r g"))    ;; insert-register
;; (global-unset-key (kbd "C-x r i"))    ;; insert-register
;; (global-unset-key (kbd "C-x r j"))    ;; jump-to-register
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r f"))    ;; frameset-to-register
;; (global-unset-key (kbd "C-x r w"))    ;; window-configuration-to-register
;; (global-unset-key (kbd "C-x r ESC"))    ;; Prefix Command
#+END_SRC

***** Binded
****** Manipulation
******* Storing
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-M-r n") 'number-to-register)
#+END_SRC

******* Copying
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-M-r x") 'copy-to-register)
#+END_SRC

******* Values
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-M-r +") 'increment-register)
#+END_SRC

****** Insertion
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-M-r i") 'insert-register)
;; (global-set-key (kbd "C-M-r j") 'jump-to-register)
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-M-r f") 'frameset-to-register)
;; (global-set-key (kbd "C-M-r w") 'window-configuration-to-register)
#+END_SRC

**** Macros
***** Unbinded
****** Recording
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x ("))    ;; kmacro-start-macro
;; (global-unset-key (kbd "C-x C-k s"))    ;; kmacro-start-macro
;; (global-unset-key (kbd "C-x C-k C-s"))    ;; kmacro-start-macro
;; (global-unset-key (kbd "<f3>"))    ;; kmacro-start-macro-or-insert-counter
;; (global-unset-key (kbd "C-x )"))    ;; kmacro-end-macro
;; (global-unset-key (kbd "C-x e"))    ;; kmacro-end-and-call-macro
;; (global-unset-key (kbd "<f4>"))    ;; kamcro-end-or-call-macro
;; (global-unset-key (kbd "S-<mouse-3>"))    ;; kmarcro-end-call-mouse
#+END_SRC

****** Counter
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k C-a"))    ;; kmacro-add-counter
;; (global-unset-key (kbd "C-x C-k C-c"))    ;; kmacro-set-counter
;; (global-unset-key (kbd "C-x C-k TAB"))    ;; kmacro-insert-counter
#+END_SRC

****** Ring
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k C-l"))    ;; kmacro-call-ring-2nd-repeat
;; (global-unset-key (kbd "C-x C-k C-n"))    ;; kmacro-cycle-ring-next
;; (global-unset-key (kbd "C-x C-k C-p"))    ;; kmacro-cycle-ring-previous
;; (global-unset-key (kbd "C-x C-k C-k"))    ;; kmacro-end-or-call-macro-repeat
;; (global-unset-key (kbd "C-x C-k C-d"))    ;; kmacro-delete-ring-head
;; (global-unset-key (kbd "C-x C-k C-t"))    ;; kmacro-swap-ring
#+END_SRC

****** Editing
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k SPC"))    ;; kmacro-step-edit-macro
;; (global-unset-key (kbd "C-x C-k RET"))    ;; kmacro-edit-macro
;; (global-unset-key (kbd "C-x C-k C-e"))    ;; kmacro-edit-macro-repeat
;; (global-unset-key (kbd "C-x C-k e"))    ;; edit-kbd-macro
;; (global-unset-key (kbd "C-x C-k l"))    ;; kmacro-edit-lossage
#+END_SRC

****** Sessions
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k n"))    ;; kmacro-name-last-macro
;; (global-unset-key (kbd "C-x C-k b"))    ;; kmacro-bind-to-key
#+END_SRC

****** Management
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x q"))    ;; kbd-macro-query
;; (global-unset-key (kbd "C-x C-k q"))    ;; kbd-macro-query
;; (global-unset-key (kbd "C-x C-k d"))    ;; kmacro-redisplay
#+END_SRC

****** Utilization
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k r"))    ;; apply-macro-to-region-lines
;; (global-unset-key (kbd "C-x C-k C-f"))    ;; kmacro-set-format
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x C-k C-v"))    ;; kmacro-view-macro-repeat
;; (global-unset-key (kbd "C-x C-k x"))    ;; kmacro-to-register
#+END_SRC

**** Bookmarks
***** Unbinded
