emacs/.emacs.d/init.org
****** General
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x r m"))    ;; bookmark-set
;; (global-unset-key (kbd "C-x r M"))    ;; bookmark-set-no-overwrite
;; (global-unset-key (kbd "C-x r b"))    ;; bookmark-jump
;; (global-unset-key (kbd "C-x r l"))    ;; bookmark-bmenu-list
#+END_SRC

**** Insertion
***** Unbinded
#+BEGIN_SRC emacs-lisp
;;(global-unset-key (kbd "M-("))    ;; insert-parentheses
;; (global-unset-key (kbd "C-x i"))    ;; insert-file
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp
;;(global-set-key (kbd "M-p") 'insert-parentheses)
#+END_SRC

**** Completion
***** Unbinded
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-M-i"))    ;; complete-symbol
#+END_SRC

**** Narrowing
***** Unbinded
****** Chunks
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x n d"))    ;; narrow-to-defun
;; (global-unset-key (kbd "C-x n n"))    ;; narrow-to-region
;; (global-unset-key (kbd "C-x n p"))    ;; narrow-to-page
;; (global-unset-key (kbd "C-x n w"))    ;; widen
#+END_SRC

****** Selective
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x $"))    ;; set-selective-display
#+END_SRC

***** Binded
****** Chunks
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "M-n d") 'narrow-to-defun)
;; (global-set-key (kbd "M-n r") 'narrow-to-region)
;; (global-set-key (kbd "M-n p") 'narrow-to-page)
;; (global-set-key (kbd "M-n w") 'widen)
#+END_SRC

**** Other
***** Binded
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-x C-g") 'glasses-mode)
#+END_SRC

*** Systems
**** D/Encoding
#+BEGIN_SRC emacs-lisp
;; (define-prefix-command 'd/encoding-prfx)
;; (global-set-key (kbd "C-z c") 'd/encoding-prfx)
#+END_SRC

***** Unbinded
****** Specifics
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x RET F"))    ;; set-file-name-coding-system
;; (global-unset-key (kbd "C-x RET k"))    ;; set-keyboard-coding-system
;; (global-unset-key (kbd "C-x RET t"))    ;; set-terminal-coding-system
;; (global-unset-key (kbd "C-x RET x"))    ;; set-selection-coding-system
#+END_SRC

****** Buffer
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x RET f"))    ;; set-buffer-file-coding-system
;; (global-unset-key (kbd "C-x RET p"))    ;; set-buffer-process-coding-system
;; (global-unset-key (kbd "C-x RET r"))    ;; revert-buffer-with-coding-system
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x RET X"))    ;; set-next-selection-coding-system
;; (global-unset-key (kbd "C-x RET c"))    ;; universal-coding-system-argument
;; (global-unset-key (kbd "C-x RET l"))    ;; set-language-environment
;; (global-unset-key (kbd "C-x RET C-\\"))    ;; set-input-method
#+END_SRC

***** Binded
****** Specifics
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z c f") 'set-file-name-coding-system)
;; (global-set-key (kbd "C-z c k") 'set-keyboard-coding-system)
;; (global-set-key (kbd "C-z c t") 'set-terminal-coding-system)
;; (global-set-key (kbd "C-z c s") 'set-selection-coding-system)
#+END_SRC

****** Buffer
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z c b") 'set-buffer-file-coding-system)
;; (global-set-key (kbd "C-z c p") 'set-buffer-process-coding-system)
;; (global-set-key (kbd "C-z c r") 'revert-buffer-with-coding-system)
#+END_SRC

****** Other
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z c S") 'set-next-selection-coding-system)
;; (global-set-key (kbd "C-z c u") 'universal-coding-system-argument)
;; (global-set-key (kbd "C-z c e") 'set-language-environment)
;; (global-set-key (kbd "C-z c /") 'set-input-method)
#+END_SRC

**** Language
#+BEGIN_SRC emacs-lisp
;; (define-prefix-command 'lang-prfx)
;; (global-set-key (kbd "C-z z") 'lang-prfx)
#+END_SRC

***** Unbinded
****** Grammer
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "M-$"))    ;; ispell-word
#+END_SRC

****** Insertion
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-x 8 RET"))    ;; insert-char
;; (global-unset-key (kbd "C-x \\"))    ;; activate-transient-input-method
#+END_SRC

***** Binded
****** Grammar
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z z w") 'ispell-word)
#+END_SRC

****** Insertion
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z z i") 'insert-char)
;; (global-set-key (kbd "C-z z /") 'activate-transient-input-method)
#+END_SRC

**** Commando
#+BEGIN_SRC emacs-lisp
(define-prefix-command 'commando-prfx)
(global-set-key (kbd "C-z x") 'commando-prfx)
#+END_SRC

***** Unbinded
****** Commands
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "M-!"))    ;; shell-command
;; (global-unset-key (kbd "M-&"))    ;; async-shell-command
;; (global-unset-key (kbd "M-|"))    ;; shell-command-on-region
;; (global-unset-key (kbd "M-X"))    ;; execute-extended-command-for-buffer
;; (global-unset-key (kbd "C-x M-:"))    ;; repeat-complex-command
;; (global-unset-key (kbd "C-x ESC ESC"))    ;; repeat-complex-command
#+END_SRC

****** Recursion
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "C-M-c"))    ;; exit-recursive-edit
#+END_SRC

****** Evaluation
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "M-:"))    ;; eval-expression
;; (global-unset-key (kbd "M-ESC :"))    ;; eval-expression
;; (global-unset-key (kbd "C-x C-e"))    ;; eval-last-sexp
#+END_SRC

***** Binded
****** Commands
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z x s") 'shell-command)
;; (global-set-key (kbd "C-z x a") 'async-shell-command)
;; (global-set-key (kbd "C-z x r") 'shell-command-on-region)
;; (global-set-key (kbd "C-z x R") 'repeat-complex-command)
#+END_SRC

****** Recursion
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z x x") 'exit-recursive-edit)
#+END_SRC

****** Evaluation
#+BEGIN_SRC emacs-lisp
;; (global-set-key (kbd "C-z x :") 'eval-expression)
#+END_SRC

*** Other
**** Help
***** Unbinded
#+BEGIN_SRC emacs-lisp
;; (global-unset-key (kbd "<f1> C-a"))    ;; about-emacs
;; (global-unset-key (kbd "<f1> C-c"))    ;; describe-copying
;; (global-unset-key (kbd "<f1> C-d"))    ;; view-emcas-debugging
;; (global-unset-key (kbd "<f1> C-e"))    ;; view-external-packages
;; (global-unset-key (kbd "<f1> C-f"))    ;; view-emacs-FAQ
;; (global-unset-key (kbd "<f1> C-h"))    ;; help-for-help
;; (global-unset-key (kbd "<f1> RET"))    ;; view-order-manuals
;; (global-unset-key (kbd "<f1> C-n"))    ;; view-emacs-news
;; (global-unset-key (kbd "<f1> C-o"))    ;; describe-distribution
;; (global-unset-key (kbd "<f1> C-p"))    ;; view-emacs-problems
;; (global-unset-key (kbd "<f1> C-s"))    ;; search-forward-help-for-help
;; (global-unset-key (kbd "<f1> C-t"))    ;; view-emacs-todo
;; (global-unset-key (kbd "<f1> C-w"))    ;; describe-no-warranty
;; (global-unset-key (kbd "<f1> C-\\"))    ;; describe-input-method
;; (global-unset-key (kbd "<f1> ."))    ;; display-local-help
;; (global-unset-key (kbd "<f1> 4"))    ;; Prefix Command
;; (global-unset-key (kbd "<f1> ?"))    ;; help-for-help
;; (global-unset-key (kbd "<f1> C"))    ;; describe-coding-system
;; (global-unset-key (kbd "<f1> F"))    ;; Info-goto-emacs-command-code
;; (global-unset-key (kbd "<f1> I"))    ;; describe-input-method
;; (global-unset-key (kbd "<f1> K"))    ;; Info-goto-emacs-key-command-node
;; (global-unset-key (kbd "<f1> L"))    ;; describe-language-environment
;; (global-unset-key (kbd "<f1> P"))    ;; describe-package
;; (global-unset-key (kbd "<f1> R"))    ;; info-display-manual
;; (global-unset-key (kbd "<f1> S"))    ;; info-lookup-symbol
;; (global-unset-key (kbd "<f1> a"))    ;; apropos-command
;; (global-unset-key (kbd "<f1> b"))    ;; describe-bindings
;; (global-unset-key (kbd "<f1> c"))    ;; describe-key-briefly
;; (global-unset-key (kbd "<f1> d"))    ;; apropos-documentation
;; (global-unset-key (kbd "<f1> e"))    ;; view-ech-area-messages
;; (global-unset-key (kbd "<f1> f"))    ;; describe-function
;; (global-unset-key (kbd "<f1> g"))    ;; describe-gnu-project
;; (global-unset-key (kbd "<f1> h"))    ;; view-hello-file
;; (global-unset-key (kbd "<f1> i"))    ;; info
;; (global-unset-key (kbd "<f1> k"))    ;; describe-key
;; (global-unset-key (kbd "<f1> l"))    ;; view-lossage
;; (global-unset-key (kbd "<f1> m"))    ;; describe-mode
;; (global-unset-key (kbd "<f1> n"))    ;; view-emacs-news
;; (global-unset-key (kbd "<f1> o"))    ;; describe-symbol
;; (global-unset-key (kbd "<f1> p"))    ;; finder-by-keyword
;; (global-unset-key (kbd "<f1> q"))    ;; help-quit
;; (global-unset-key (kbd "<f1> r"))    ;; info-emacs-manual
;; (global-unset-key (kbd "<f1> s"))    ;; describe-syntax
;; (global-unset-key (kbd "<f1> t"))    ;; help-with-tutorial
;; (global-unset-key (kbd "<f1> v"))    ;; describe-variable
;; (global-unset-key (kbd "<f1> w"))    ;; where-is
;; (global-unset-key (kbd "<f1> x"))    ;; describe-command
#+END_SRC

**** Menus
***** Unbinded
****** General
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "<f10>"))    ;; menu-bar-open
(global-unset-key (kbd "M-`"))    ;; tmm-menubar
(global-unset-key (kbd "S-<f10>"))    ;; context-menu-open
(global-unset-key (kbd "C-<f10>"))    ;; buffer-menu-open
(global-unset-key (kbd "C-<down-mouse-1>"))    ;; mouse-buffer-menu
#+END_SRC

****** Customization
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-<down-mouse-2>"))    ;; facemenu-menu
(global-unset-key (kbd "S-<down-mouse-1>"))    ;; mouse-appearance-menu
#+END_SRC

**** Prefixes
***** Unbinded
Non-user created prefixes
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x *"))    ;; calc-dispatch
(global-unset-key (kbd "C-x 4"))    ;; ctrl-x-4-prefix
(global-unset-key (kbd "C-x 5"))    ;; ctrl-x-5-prefix
(global-unset-key (kbd "C-x 6"))    ;; 2C-command
(global-unset-key (kbd "C-x C-k"))    ;; kmacro-keymap
(global-unset-key (kbd "C-x v"))    ;; vc-prefix-map
#+END_SRC

**** Compensation
***** Functions
#+BEGIN_SRC emacs-lisp
(defun text-scaler()
  )
#+END_SRC

***** Unbinded
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x C-+"))    ;; text-scale-adjust
(global-unset-key (kbd "C-x C--"))    ;; text-scale-adjust
(global-unset-key (kbd "C-x C-0"))    ;; text-scale-adjust
(global-unset-key (kbd "C-x C-="))    ;; text-scale-adjust
(global-unset-key (kbd "C-<wheel-up>"))    ;; mouse-wheel-text-scale
(global-unset-key (kbd "C-<wheel-down>"))    ;; mouse-wheel-text-scale
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Informative
***** Unbinded
****** Counting
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-="))    ;; count-words-region
(global-unset-key (kbd "C-x l"))    ;; count-lines-page
#+END_SRC

****** Cursor
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x ="))    ;; what-cursor-position
#+END_SRC

**** Sakura
***** Unbinded
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-M-<mouse-1>"))    ;; mouse-set-point
(global-unset-key (kbd "M-~"))    ;; not-modified
(global-unset-key (kbd "C-x C-n"))    ;; set-goal-column
(global-unset-key (kbd "C-x x f"))    ;; font-lock-update
(global-unset-key (kbd "C-x x t"))    ;; toggle-truncate-lines
(global-unset-key (kbd "M-ESC ESC"))    ;; keyboard-escape-quit
#+END_SRC

** Local
*** Major Mode
**** CC Mode
***** CC Common
****** Hungry Delete
Hungry Delete is a function that will either delete the whitespace up to a non-whitespace character or delete the preceeding/proceeding character.

#+BEGIN_SRC emacs-lisp
(defun cc-hungry-delete()
  (local-unset-key (kbd "C-c DEL"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-DEL"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-<backspace>"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-<delete>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c C-<deletechar>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c <deletechar>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c C-d"))    ;; c-hungry-delete-forward
  (local-set-key (kbd "C-c C-f") 'c-hungry-delete-forward)
  (local-set-key (kbd "C-c C-b") 'c-hungry-delete-backwards)
  )
#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun cc-common-bindings()
  'cc-hungry-delete
  )
#+END_SRC

***** C Lang
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun c-mode-bindings()
  )
#+END_SRC

***** C++
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun cpp-mode-bindings()
  )
#+END_SRC

***** Obj-C
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun objc-mode-bindings()
  )
#+END_SRC

***** Java
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun java-mode-bindings()
  )
#+END_SRC

***** Idl
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun idl-mode-bindings()
  )
#+END_SRC

***** Pike
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun pike-mode-bindings()
  )
#+END_SRC

***** Awk
****** General
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Main Function
#+BEGIN_SRC emacs-lisp
(defun awk-mode-bindings()
  )
#+END_SRC

**** The Founding Fathers
The Founding Fathers is a funny little thing I decided to refer to functions of Emacs that make Emacs what it is. Got the idea of "Founding Fathers" from TheRussianBadger.

***** Org Mode
****** Unbinded
******* Todo
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Narrowing
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Binded
******* ToDo
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Babel
#+BEGIN_SRC emacs-lisp

#+END_SRC

***** ToDo Mode
****** Unbinded
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Binded
#+BEGIN_SRC emacs-lisp

#+END_SRC

***** RMail
****** Unbinded
******* Composing
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x m"))    ;; compose-mail
#+END_SRC

******* Management
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Binded
******* Composing
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Management
#+BEGIN_SRC emacs-lisp

#+END_SRC

***** nXML Mode
****** Unbinded
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Binded
#+BEGIN_SRC emacs-lisp

#+END_SRC

***** Shell Mode
#+BEGIN_SRC emacs-lisp

#+END_SRC

*** Minor Mode
Though "local" refers to Major modes, I decided to include others that I think "relate" to the concept of "local."

**** Auto Fill Mode
Auto Fill mode can be thought of as Microsoft Word's text formatting abilities. When you get to the end of a line, it will put the overflowing text on the next line and being able
to set the alignment of your text.

#+BEGIN_SRC emacs-lisp
(define-prefix-command 'autofill-prfx)
(global-set-key (kbd "C-q") 'autofill-prfx)
#+END_SRC

***** Unbinded
****** Parameters
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-x ."))    ;; set-fill-prefix
(global-unset-key (kbd "C-x f"))    ;; set-fill-column
#+END_SRC

****** Filling
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "M-q"))    ;; fill-paragraph
#+END_SRC

***** Binded
****** Activation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-q a") 'auto-fill-mode)
#+END_SRC

