emacs/.emacs.d/init.el





(global-unset-key (kbd "M-ESC ESC"))    ;; keyboard-escape-quit

(defun cc-hungry-delete()
  (local-unset-key (kbd "C-c DEL"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-DEL"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-<backspace>"))    ;; c-hungry-delete-backwards
  (local-unset-key (kbd "C-c C-<delete>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c C-<deletechar>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c <deletechar>"))    ;; c-hungry-delete-forward
  (local-unset-key (kbd "C-c C-d"))    ;; c-hungry-delete-forward
  (local-set-key (kbd "C-c C-f") 'c-hungry-delete-forward)
  (local-set-key (kbd "C-c C-b") 'c-hungry-delete-backwards)
  )

(defun cc-common-bindings()
  'cc-hungry-delete)









(define-prefix-command 'autofill-prfx)
(global-set-key (kbd "C-q") 'autofill-prfx)

(global-unset-key (kbd "C-x ."))    ;; set-fill-prefix
(global-unset-key (kbd "C-x f"))    ;; set-fill-column

(global-unset-key (kbd "M-q"))    ;; fill-paragraph

(global-set-key (kbd "C-q a") 'auto-fill-mode)
