emacs/.emacs.d/init.org
****** Parameters
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-q .") 'set-fill-prefix)
(global-set-key (kbd "C-q f") 'set-fill-column)
#+END_SRC

****** Filling
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-q p") 'fill-paragraph)
(global-set-key (kbd "C-q r") 'fill-region)
(global-set-key (kbd "C-q P") 'fill-region-as-paragraph)
(global-set-key (kbd "C-q c") 'center-line)
#+END_SRC

**** Rectangle Mark Mode
The plan here is to use association lists to map and unmap keybindings within the minor mode.

***** Unbinded
****** Utilization
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'rect
  (define-key rectangle-mark-mode-map (kbd "C-o") nil)    ;; open-rectangle
  (define-key rectangle-mark-mode-map (kbd "C-t") nil))    ;; string-rectangle
#+END_SRC

***** Binded
****** Utilization
#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'rect
  (define-key rectangle-mark-mode-map (kbd "k") 'kill-rectangle)
  (define-key rectangle-mark-mode-map (kbd "y") 'yank-rectangle)
  (define-key rectangle-mark-mode-map (kbd "c") 'clear-rectangle)
  (define-key rectangle-mark-mode-map (kbd "o") 'open-rectangle)
  (define-key rectangle-mark-mode-map (kbd "s") 'string-rectangle)
  (define-key rectangle-mark-mode-map (kbd "d") 'delete-rectangle)
  (define-key rectangle-mark-mode-map (kbd "R") 'copy-rectangle-to-register))
#+END_SRC

*** Ammusements
I mean, who doesn't love playing games while they're at work?!

#+BEGIN_SRC emacs-lisp
(define-prefix-command 'ammusements-prfx)
(global-set-key (kbd "C-`") 'ammusements-prfx)
#+END_SRC

**** Blackbox
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` b") 'blackbox)
#+END_SRC

**** Mpuz
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` m") 'mpuz)
#+END_SRC

**** Bubbles
Bubbles is where you try and remove the most amount of bubbles with the least amount of moves.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` B") 'bubbles)
#+END_SRC

**** Decipher
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` d") 'decipher)
#+END_SRC

**** Dissociated Press
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` D") 'dissociated-press)
#+END_SRC

**** Dunnet
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` C-d") 'dunnet)
#+END_SRC

**** Gomoku
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` g") 'gomoku)
#+END_SRC

**** Hanoi
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` h") 'hanoi)
#+END_SRC

**** Life
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` l") 'life)
#+END_SRC

**** Morse Region
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` M") 'morse-region)
#+END_SRC

**** Pong
***** Unbinded
****** Controls
#+BEGIN_SRC emacs-lisp
(defun pong-controls-unbind()
  (local-unset-key (kbd "2"))    ;; pong-move-down
  (local-unset-key (kbd "4"))    ;; pong-move-left
  (local-unset-key (kbd "6"))    ;; pong-move-right
  (local-unset-key (kbd "8"))    ;; pong-move-up
  (local-unset-key (kbd "<down>"))    ;; pong-move-down
  (local-unset-key (kbd "<left>"))    ;; pong-move-left
  (local-unset-key (kbd "<right>"))    ;; pong-move-right
  (local-unset-key (kbd "<up>"))    ;; pong-move-up
  )
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` p") 'pong)
#+END_SRC

****** Controls
#+BEGIN_SRC emacs-lisp
(defun pong-controls()
  (local-set-key (kbd "w") 'pong-move-left)
  (local-set-key (kbd "s") 'pong-move-right)
  (local-set-key (kbd "o") 'pong-move-up)
  (local-set-key (kbd "l") 'pong-move-down)
  )
#+END_SRC

**** Snake
***** Unbinded
****** Controls
#+BEGIN_SRC emacs-lisp
(defun snake-controls-unbind()
  )
#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` s") 'snake)
#+END_SRC

****** Controls
#+BEGIN_SRC emacs-lisp
(defun snake-controls()
  )
#+END_SRC

**** Tetris
***** Unbinded
****** Controls
#+BEGIN_SRC emacs-lisp

#+END_SRC

***** Binded
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` t") 'tetris)
#+END_SRC

****** Controls
#+BEGIN_SRC emacs-lisp
(defun tetris-controls()
  )
#+END_SRC

**** Solitaire
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` S") 'solitaire)
#+END_SRC

**** Zone
Emacs version of a screensaver.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` z") 'zone)
#+END_SRC

**** Butterfly
Switches a bit on your drive.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` C-b") 'butterfly)
#+END_SRC

**** Doctor
Acts like the therapist you could never afford.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-` C-D") 'doctor)
#+END_SRC

* Plasmids
I love the Bioshock series and felt like naming mode definitions after it. Some of these modes were made to help free up some global keybindings. Also who said I couldn't have fun
with my configuration file? Kinda thought that people are a bit "too" serious when naming some stuff (though feel free to call me out on some hypocrisies here haha).

** Delta
*** Audio Diary
This minor mode is named after the main protagonist of Bioshock 2, the Big Daddy, Delta. I chose Delta because it would be reminiscent of the Good ending route that I had gotten
(where Eleanor Lamb saves her mother from drowning and all the little sisters are alive). I also got the idea from what Grace Holloway said, "You had me under a gun... yet you just
walk away? No monster alive turns the other cheek. No monster does that. A thinking man does that."

I created this mode so I could write more with Emacs without missing out on too many features, even extending existing features, that are in other Word Processors (e.g., Microsoft
Word, Libre Writer). I didn't want to have to pay for MS Word as I thought I wouldn't have much use for it in the future (may still have to if I want complexer document formatting
or working) and LibreOffice's look kinda throws me off (still very good software though!). So I thought, "why not just make that in my own config?", and here we are.

Why is this not a major mode you ask? Well, because of Org Mode you fucking troglodyte.

Some big idea I have for this little project is that I may create a file format named orgx, reminiscent of docx. Would this be very unnecessary? Absolutely! Am I still going to try
and do it? FUCK YEAH!!! I'll most likely make this a package since this does seem like something that would definitely benefit other users, but first I'm going to make sure it'll
work on my own Windows machine first lol.

**** Orgx
***** Image Rendering
Due to the way that archive files (e.g., tarball) work, simply putting in the path of an image and rendering it while inside the archive file will not render the image. In order to
do this, a temporary replication of the file structure that leads to the image will need to be created (sort of like a swap file in a way).

**** Features and Documentation
***** Table of Contents

***** List formatting

***** References (MLA, APA)

****** Citing

****** List sources

***** Footnotes

****** Insert at a specificed page

***** Hyphenation

***** Page Marker
Automatically place the page character after a certain amount of lines have been surpassed, either from the last marker or from the beginning of the Org file

***** Ribbon

*** Little Sisters
**** Table of Contents
I wanted to take a stab at making my own Table of Contents insertion tool since the popular one seems to not be maintained anymore (toc-org) and it just doens't work for some
reason. It'll insert a table of contents wherever there is a header that's named "Table of Contents" or a header that is tagged with TOC (case insensitive).

#+BEGIN_SRC emacs-lisp

#+END_SRC

**** List Formatting
This feature is based on the MS Word list insertion tool.

#+BEGIN_SRC emacs-lisp

#+END_SRC

**** References
This is really just an Emacs implementation of Microsoft Word's source management feature. What? You thought I could just make my own without any reference? You expect too much of
me. Really.

***** Sources
****** Creation
******* Book
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Book Section
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Journal Article
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Article in a Periodical
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Conference Proceedings
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Report
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Website
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Document from Website
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Electronic Source
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Art
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Sound Recording
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Performance
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Film
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Interview
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Patent
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Case
#+BEGIN_SRC emacs-lisp

#+END_SRC

******* Miscellaneous
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Insertion
Allows the selection of a source and insertion of a source; either in the form of a citation (according to style: e.g., APA) or insert a part of a source (e.g., link, author).

#+BEGIN_SRC emacs-lisp

#+END_SRC

****** Source Manager
List sources as well as search and sort according to various aspects (e.g., source type).

#+BEGIN_SRC emacs-lisp
(define-minor-mode source-manager
  "Text"
  :init-value nil
  :lighter "Source"
  :keymaps
  '(([C-M-w] . split-window-below)
	)
  )
#+END_SRC

***** Citing
****** MLA Format 9th Edition
#+BEGIN_SRC emacs-lisp

#+END_SRC

****** APA Format 7th Edition
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Footnotes
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Hyphenation
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Page Marker
#+BEGIN_SRC emacs-lisp

#+END_SRC

**** Ribbon
A togglable ribbon, similar to Microsoft Word's.

#+BEGIN_SRC emacs-lisp

#+END_SRC

*** Big Daddy
#+BEGIN_SRC emacs-lisp
(define-minor-mode delta-mode
  "aaaaauuuuuuuggggghhhh"
  :init-value nil
  :lighter " Delta"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )
#+END_SRC

** Eleanor
*** Audio Diary
This minor mode is named after the little sister that had belonged to Delta, Eleanor Lamb. I named this mode after her because if you look out the big windows of Rapture, you see a
beautiful, glowing, yet deteriorating city. You realize that there is more that could be out there. That's when I decided to have Eleanor be the name of the mode that helps the
user manage their workspace.

I created this mode mainly so that I could free up some keys that were originally for window management and then transfer them over to a more scoped in scenario. I then recently
wanted to try and give it more purpose with an emphasis on workspace management that is tailored to my use cases. Even if I may not use it "too" often, it'll still be a great tool
to have on hand.

**** Features
- Resizing
- Splitting
- Window Swapping
- Tab management
- Frame management

*** Big Sister
#+BEGIN_SRC emacs-lisp
(define-minor-mode eleanor-mode
  "The Rapture dream is over, but in waking, I am reborn"
  :init-value nil
  :lighter " Eleanor"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )
#+END_SRC

** Jack
*** Audio Diary
This minor mode is named after the main protagonist of Bioshock, Jack. I couldn't really find a fitting character for this mode so I decided to go with Jack. There's not really
anyone I can think of that just kills everyone besides the Splicers I guess.

I created this mode to free up some keybindings but it also allows me to keep deleting stuff with some easier keybindings.

**** Features
- Words
- Sentences
- Paragraphs
- Expressions
- Functions
- Pages

*** Big Daddy
#+BEGIN_SRC emacs-lisp
(define-minor-mode jack-mode
  "I chose to batter that man with a golf club"
  :init-value nil
  :lighter " Jack"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )
#+END_SRC

** Atlas
*** Audio Diary
This minor mode is named after the main main antagonist of Bioshock, Fontaine. I decided on this because of the fake persona he had created, Atlas. After thinking about that, I
thought he'd perfectly fit the theme of this mode, Manipulation.

This mode makes text manipulation easier and also be able to provide more varied keybindings. It'll allow movement of a large amount of sentences and paragraphs without having to
use convoluted keybindings that break your pinky.

**** Features
- Transposing
- Cases

*** Big Daddy
#+BEGIN_SRC emacs-lisp
(define-minor-mode atlas-mode
  "Would you kindly"
  :init-value nil
  :lighter " Atlas"
  :keymap
  '(([C-M w] . split-window-below)
	)
  )
#+END_SRC

** Markdown Mode
*** Audio Diary
I created this mode since I couldn't really find a "good" major mode package so I just went and decided to make my own.

**** Features
- Highlighting

*** Little Sisters
**** Highlighting
#+BEGIN_SRC emacs-lisp

#+END_SRC

*** Big Daddy
#+BEGIN_SRC emacs-lisp

#+END_SRC

