emacs/.emacs.d/init.el

(global-set-key (kbd "C-q .") 'set-fill-prefix)
(global-set-key (kbd "C-q f") 'set-fill-column)

(global-set-key (kbd "C-q p") 'fill-paragraph)
(global-set-key (kbd "C-q r") 'fill-region)
(global-set-key (kbd "C-q P") 'fill-region-as-paragraph)
(global-set-key (kbd "C-q c") 'center-line)

(with-eval-after-load 'rect
  (define-key rectangle-mark-mode-map (kbd "C-o") nil)    ;; open-rectangle
  (define-key rectangle-mark-mode-map (kbd "C-t") nil))    ;; string-rectangle

(with-eval-after-load 'rect
  (define-key rectangle-mark-mode-map (kbd "k") 'kill-rectangle)
  (define-key rectangle-mark-mode-map (kbd "y") 'yank-rectangle)
  (define-key rectangle-mark-mode-map (kbd "c") 'clear-rectangle)
  (define-key rectangle-mark-mode-map (kbd "o") 'open-rectangle)
  (define-key rectangle-mark-mode-map (kbd "s") 'string-rectangle)
  (define-key rectangle-mark-mode-map (kbd "d") 'delete-rectangle)
  (define-key rectangle-mark-mode-map (kbd "R") 'copy-rectangle-to-register))

(define-prefix-command 'ammusements-prfx)
(global-set-key (kbd "C-`") 'ammusements-prfx)

(global-set-key (kbd "C-` b") 'blackbox)

(global-set-key (kbd "C-` m") 'mpuz)

(global-set-key (kbd "C-` B") 'bubbles)

(global-set-key (kbd "C-` d") 'decipher)

(global-set-key (kbd "C-` D") 'dissociated-press)

(global-set-key (kbd "C-` C-d") 'dunnet)

(global-set-key (kbd "C-` g") 'gomoku)

(global-set-key (kbd "C-` h") 'hanoi)

(global-set-key (kbd "C-` l") 'life)

(global-set-key (kbd "C-` M") 'morse-region)

(defun pong-controls-unbind()
  (local-unset-key (kbd "2"))    ;; pong-move-down
  (local-unset-key (kbd "4"))    ;; pong-move-left
  (local-unset-key (kbd "6"))    ;; pong-move-right
  (local-unset-key (kbd "8"))    ;; pong-move-up
  (local-unset-key (kbd "<down>"))    ;; pong-move-down
  (local-unset-key (kbd "<left>"))    ;; pong-move-left
  (local-unset-key (kbd "<right>"))    ;; pong-move-right
  (local-unset-key (kbd "<up>"))    ;; pong-move-up
  )

(global-set-key (kbd "C-` p") 'pong)

(defun pong-controls()
  (local-set-key (kbd "w") 'pong-move-left)
  (local-set-key (kbd "s") 'pong-move-right)
  (local-set-key (kbd "o") 'pong-move-up)
  (local-set-key (kbd "l") 'pong-move-down)
  )

(defun snake-controls-unbind()
  )

(global-set-key (kbd "C-` s") 'snake)

(defun snake-controls()
  )



(global-set-key (kbd "C-` t") 'tetris)

(defun tetris-controls()
  )

(global-set-key (kbd "C-` S") 'solitaire)

(global-set-key (kbd "C-` z") 'zone)

(global-set-key (kbd "C-` C-b") 'butterfly)

(global-set-key (kbd "C-` C-D") 'doctor)









































(define-minor-mode source-manager
  "Text"
  :init-value nil
  :lighter "Source"
  :keymaps
  '(([C-M-w] . split-window-below)
	)
  )













(define-minor-mode delta-mode
  "aaaaauuuuuuuggggghhhh"
  :init-value nil
  :lighter " Delta"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )

(define-minor-mode eleanor-mode
  "The Rapture dream is over, but in waking, I am reborn"
  :init-value nil
  :lighter " Eleanor"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )

(define-minor-mode jack-mode
  "I chose to batter that man with a golf club"
  :init-value nil
  :lighter " Jack"
  :keymap
  '(([C-M-w] . split-window-below)
	)
  )

(define-minor-mode atlas-mode
  "Would you kindly"
  :init-value nil
  :lighter " Atlas"
  :keymap
  '(([C-M w] . split-window-below)
	)
  )




